app/graphql/types/query_type.rb

    def schedule(id:)
      Schedule.find(id)
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def user(id:)
      User.find(id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]